#CREATE String
a='привет' #Одинарные кавычки
b="привет"#Двойные кавычки
c="я 'знаю' Python" #Комбинированные кавычки
d='я "знаю" Python' #Можно и так
e='я "знаю' Python" # Так нельзя, кавычки в перемешку

a=123 # Целочисленный тип
a=str(a) # Результат "123"
str{[1,11,'a']} #Результат "[1,11,'a']"
str(True) #Результат 'True'
str(None) #Результат 'None'
a='привет'
b='Иван'
c=f"{a} я {b}" #привет я Иван
a='привет'
print(a)
print('Иван')
a='привет'
a=[0]
a=[1]
a=[2]
a=[3]
a=[4]
a=[5]
a=[6]
a=[-1]
a=[-2]
a=[-3]
a=[-4]
a=[-5]
a=[-6]
a=[-7]
a='привет'
a=[0]=6
a='бривет'
a='привет'
a[0]
a
a='привет'
b='мир'
c=a+b
print(c)
c+=b
a='привет'
b=2
c=a*b
print(с)
a*=b
a=
b=
c=str()

# TEST

a = 'я ходил с Ваней в магазин'
type(a)
<class 'str'>
b = 'купил себе тоже еду'
c = f"{a} и {b}"
print(c)
я ходил с Ваней в магазин и купил себе тоже еду
s = 'Кит на море не романтик'
s.split()
['Кит', 'на', 'море', 'не', 'романтик']
str.lower(s)
'кит на море не романтик'
s.lower()
'кит на море не романтик'
